742117806/CarrierProj/电力载波程序固件/(0201)carrier+wireless V1.3/API/Src/stm32f030_peripheral.c
/*Flash Read Write */
void FLASHWrite( uint32_t offset, uint32_t* buf, uint16_t len )
{
    __IO uint32_t data32 = 0;
    uint32_t Address = 0, PageError = 0;
    HAL_FLASH_Unlock();
    EraseInitStruct.TypeErase = TYPEERASE_PAGES;
    EraseInitStruct.PageAddress = FLASH_USER_START_ADDR;
    EraseInitStruct.NbPages = ( FLASH_USER_END_ADDR - FLASH_USER_START_ADDR ) / FLASH_PAGE_SIZE;
    if( HAL_FLASHEx_Erase( &EraseInitStruct, &PageError ) != HAL_OK )
    {
        while( 1 )
            ;
    }
    /* Program the user Flash area word by word
    (area defined by FLASH_USER_START_ADDR and FLASH_USER_END_ADDR) ***********/
    Address = FLASH_USER_START_ADDR + offset;
    while( len-- )
    {
        if( HAL_FLASH_Program( TYPEPROGRAM_WORD, Address, *buf++ ) == HAL_OK )
        {
            Address = Address + 4;
        }
        else
        {
            while( 1 )
            {
            }
        }
    }
    HAL_FLASH_Lock();
}
void FLASHRead( uint32_t offset, uint32_t* buf, uint16_t len )
{
    __IO uint32_t data32 = 0;
    uint32_t Address = 0;
    Address = FLASH_USER_START_ADDR + offset;
    while( len-- )
    {
        *buf++ = *( __IO uint32_t* )Address;
        Address = Address + 4;
    }
}

void USARTx_Init( void )
{
    UartHandleUp.Instance = EVAL_COM1;
    UartHandleUp.Init.BaudRate = 9600;
    UartHandleUp.Init.WordLength = UART_WORDLENGTH_9B;
    UartHandleUp.Init.StopBits = UART_STOPBITS_1;
    UartHandleUp.Init.Parity = UART_PARITY_EVEN;
    UartHandleUp.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UartHandleUp.Init.Mode = UART_MODE_TX_RX;
    BSP_COM_Init( COM1, &UartHandleUp );
    /*configure interrupt dbg port */
    HAL_NVIC_SetPriority( EVAL_COM1_IRQn, 4, 0 );
    HAL_NVIC_EnableIRQ( EVAL_COM1_IRQn );
    /*down port*/
    UartHandleDown.Instance = EVAL_COM2;
#ifdef MASTER
    UartHandleDown.Init.BaudRate = 9600;
#else
    UartHandleDown.Init.BaudRate = 9600;
#endif
    UartHandleDown.Init.WordLength = UART_WORDLENGTH_9B;
    UartHandleDown.Init.StopBits = UART_STOPBITS_1;
    UartHandleDown.Init.Parity = UART_PARITY_EVEN;
    UartHandleDown.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UartHandleDown.Init.Mode = UART_MODE_TX_RX;
    BSP_COM_Init( COM2, &UartHandleDown );
    /*configure interrupt*/
    HAL_NVIC_SetPriority( EVAL_COM2_IRQn, 4, 0 );
    HAL_NVIC_EnableIRQ( EVAL_COM2_IRQn );
    STUpUartFrame.p_buf = gUpRxInterruptBuf;
    STDownUartFrame.p_buf = gDownRxInterruptBuf;
    if( HAL_UART_Receive_IT( &UartHandleUp, ( uint8_t* )gUpRxBuffer, 1 ) != HAL_OK )
        ;
    if( HAL_UART_Receive_IT( &UartHandleDown, ( uint8_t* )gDownRxBuffer, 1 ) != HAL_OK )
        ;
}
void USER_UART_Hand( UART_HandleTypeDef* UartHandle )
{
    if( UartHandle->Instance == EVAL_COM1 )
    {
        if( gRxUart1Flag == SET )
        {
            LowUpUartProcess();
            gRxUart1Flag = RESET;
        }
    }
    else if( UartHandle->Instance == EVAL_COM2 )
    {
        if( gRxUart2Flag == SET )
        {
            LowDownUartProcess();
            gRxUart2Flag = RESET;
        }
    }
}
void HAL_UART_TxCpltCallback( UART_HandleTypeDef* UartHandle )
{
    /* Set Transfer flag: trasfer complete*/
    if( UartHandle->Instance == EVAL_COM1 )
    {
        gTxUart1Flag = SET;
    }
    else if( UartHandle->Instance == EVAL_COM2 )
    {
        gTxUart2Flag = SET;
    }
}
void HAL_UART_RxCpltCallback( UART_HandleTypeDef* UartHandle )
{
    /*set reception flag:receive ok*/
    if( UartHandle->Instance == EVAL_COM1 )
    {
        gRxUart1Flag = SET;
    }
    else if( UartHandle->Instance == EVAL_COM2 )
    {
        //gRxUart2Flag = SET;
        LowDownUartProcess();
    }
}
void HAL_UART_ErrorCallback( UART_HandleTypeDef* UartHandle )
{
    /*
    BSP_LED_On(LED1);
    BSP_LED_On(LED2);
    BSP_LED_On(LED3);

    if(UartHandle->Instance == EVAL_COM1)
    {
    EVAL_COM1_FORCE_RESET();
    EVAL_COM1_RELEASE_RESET();
    BSP_COM_Init(COM1,&UartHandleUp);
    memset(&STUpUartFrame,0,sizeof(STUpUartFrame));
    gTxUart1Flag = SET;/ *=SET tx_compile* /
    gRxUart1Flag = RESET;/ *=.RESET can receive* /
    if(HAL_UART_Receive_IT(&UartHandleUp, (uint8_t *)gUpRxBuffer,1) != HAL_OK)
    {
     // Error_Handler();
    }
    }
    if(UartHandle->Instance == EVAL_COM2)
    {
    EVAL_COM2_FORCE_RESET();
    EVAL_COM2_RELEASE_RESET();
    BSP_COM_Init(COM2,&UartHandleDown);
    memset(&STDownUartFrame,0,sizeof(STDownUartFrame));
    gTxUart2Flag = SET;/ *=SET tx_compile* /
    gRxUart2Flag = RESET;/ *=.RESET can receive* /
    if(HAL_UART_Receive_IT(&UartHandleDown, (uint8_t *)gDownRxBuffer,1) != HAL_OK)
    {
     // Error_Handler();
    }
    }
    */
    UartHandle->ErrorCode = HAL_UART_ERROR_NONE;
    // while (1)
    //     ;
}
#if 0
static void LowDownUartProcess( void )
{
    static uint8_t rx_len = 0;
    uint8_t USART_RcvByte = gDownRxBuffer[0];
    switch( STDownUartFrame.rx_step )
    {
        case 0:                        //head
            if( USART_RcvByte == 0x67 ) //head 0x67
            {
                STDownUartFrame.rx_step = 1;
                STDownUartFrame.head = USART_RcvByte;
                STDownUartFrame.p_buf[0] = USART_RcvByte;
                rx_len = 1;
            }
            else if( USART_RcvByte == 0x68 )
            {
                STDownUartFrame.rx_step = 1;
                STDownUartFrame.head = USART_RcvByte;
                STDownUartFrame.p_buf[0] = USART_RcvByte;
                rx_len = 1;
            }
            break;
        case 1: //len byte.totol len.
            if( STDownUartFrame.head == 0x67 )
            {
                STDownUartFrame.len = USART_RcvByte;
                STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
                STDownUartFrame.rx_step = 2;
                if( STDownUartFrame.p_buf == NULL )
                {
                    STDownUartFrame.p_buf = gDownRxInterruptBuf;
                }
            }
            else //addr.6byte.
            {
                STDownUartFrame.addr[rx_len - 1] = USART_RcvByte;
                STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
                if( rx_len >= 7 )
                {
                    STDownUartFrame.rx_step = 2;
                }
            }
            break;
        case 2:
            if( STDownUartFrame.head == 0x67 )
            {
                if( rx_len < STDownUartFrame.len )
                {
                    STDownUartFrame.p_buf[rx_len] = USART_RcvByte;
                    rx_len++;
                }
                if( rx_len >= STDownUartFrame.len )
                {
                    if( USART_RcvByte == 0x16 )
                    {
                        STDownUartFrame.p_buf[0] = STDownUartFrame.head;
                        STDownUartFrame.p_buf[1] = STDownUartFrame.len;
                        STDownUartFrame.is_flag = 1;
                    }
                    else
                    {
                        STDownUartFrame.p_buf[0] = 0xfe;
                        STDownUartFrame.p_buf[1] = STDownUartFrame.len;
                        STDownUartFrame.is_flag = 1;
                    }
                    STDownUartFrame.rx_step = 0;
                    rx_len = 0;
                }
            }
            else // 68 .. head
            {
                if( USART_RcvByte == 0x68 )
                {
                    STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
                    STDownUartFrame.rx_step = 3;
                }
                else
                {
                    STDownUartFrame.rx_step = 0;
                    rx_len = 0;
                }
            }
            break;
        case 3: //命令字节。（控制码）
        {
            STDownUartFrame.cmd = USART_RcvByte;
            STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
            STDownUartFrame.rx_step = 4;
        }
        break;
        case 4: //数据长度字节，接下来将要接收的数据总长度。
            if( USART_RcvByte == 0 )
            {
                STDownUartFrame.rx_step = 6;
                STDownUartFrame.len_sub = 0;
                STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
                break;
            }
            else if( USART_RcvByte >= ( MAXDOWNBUF - 32 ) )
            {
                STDownUartFrame.len_sub = ( MAXDOWNBUF - 32 );
                STDownUartFrame.is_flag = 2; //接收长度位有错。
            }
            else
            {
                STDownUartFrame.len_sub = USART_RcvByte;
                STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
            }
            STDownUartFrame.rx_step = 5;
            break;
        case 5:
            if( rx_len < STDownUartFrame.len_sub + 10 )
            {
                STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
            }
            if( rx_len >= STDownUartFrame.len_sub + 10 )
            {
                STDownUartFrame.rx_step = 6;
            }
            break;
        case 6:
            STDownUartFrame.sum = USART_RcvByte;
            STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
            STDownUartFrame.rx_step = 7;
            break;
        case 7:
            if( USART_RcvByte == 0x16 )
            {
                STDownUartFrame.is_flag = 1;
                STDownUartFrame.rx_step = 0;
                STDownUartFrame.end_char = USART_RcvByte;
                STDownUartFrame.p_buf[rx_len++] = USART_RcvByte;
                STDownUartFrame.len = rx_len;
            }
            rx_len = 0;
            break;
        default:
            rx_len = 0;
            STDownUartFrame.rx_step = 0;
            STDownUartFrame.is_flag = 0;
            break;
    }
    STDownUartFrame.Over_time_count = 5;
    /*enable interrupt for receive next buffer*/
    if( HAL_UART_Receive_IT( &UartHandleDown, ( uint8_t* )gDownRxBuffer, 1 ) != HAL_OK )
    {
        //Error_Handler();
    }
}
#else
static void LowDownUartProcess( void )
{
    uint8_t USART_RcvByte = gDownRxBuffer[0];
    //    static uint8_t rx_len = 0;
    if( ( STDownUartFrame.is_flag & 0x01 ) == 0 )
    {
        STDownUartFrame.Over_time_count = 100;
        STDownUartFrame.p_buf[STDownUartFrame.len] = USART_RcvByte;
        STDownUartFrame.len ++;
    }
    /*enable interrupt for receive next buffer*/
    // if (HAL_UART_Receive_IT(&UartHandleDown, (uint8_t *)gDownRxBuffer, 1) != HAL_OK)
    //{
    //Error_Handler();
    //}
}


#endif
static void LowUpUartProcess( void )
{
    static uint8_t rx_len = 0;
    uint8_t USART_RcvByte = gUpRxBuffer[0];
    switch( STUpUartFrame.rx_step )
    {
        case 0:                        //head
            if( USART_RcvByte == 0x67 ) //head 0x67
            {
                STUpUartFrame.rx_step = 1;
                STUpUartFrame.head = USART_RcvByte;
                STUpUartFrame.p_buf[0] = USART_RcvByte;
                rx_len = 1;
            }
            else if( USART_RcvByte == 0x68 )
            {
                STUpUartFrame.rx_step = 1;
                STUpUartFrame.head = USART_RcvByte;
                STUpUartFrame.p_buf[0] = USART_RcvByte;
                rx_len = 1;
            }
            break;
        case 1: //len byte.totol len.
            if( STUpUartFrame.head == 0x67 )
            {
                STUpUartFrame.len = USART_RcvByte;
                STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
                STUpUartFrame.rx_step = 2;
                if( STUpUartFrame.p_buf == NULL )
                {
                    STUpUartFrame.p_buf = gUpRxInterruptBuf;
                }
            }
            else //addr.6byte.
            {
                STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
                if( rx_len >= 7 )
                {
                    STUpUartFrame.rx_step = 2;
                }
            }
            break;
        case 2:
            if( STUpUartFrame.head == 0x67 )
            {
                if( rx_len < STUpUartFrame.len )
                {
                    STUpUartFrame.p_buf[rx_len] = USART_RcvByte;
                    rx_len++;
                }
                if( rx_len >= STUpUartFrame.len )
                {
                    if( USART_RcvByte == 0x16 )
                    {
                        STUpUartFrame.p_buf[0] = STUpUartFrame.head;
                        STUpUartFrame.p_buf[1] = STUpUartFrame.len;
                        STUpUartFrame.is_flag = 1;
                    }
                    else
                    {
                        STUpUartFrame.p_buf[0] = 0xfe;
                        STUpUartFrame.p_buf[1] = STUpUartFrame.len;
                        STUpUartFrame.is_flag = 1;
                    }
                    STUpUartFrame.rx_step = 0;
                    rx_len = 0;
                }
            }
            else // 68 .. head
            {
                if( USART_RcvByte == 0x68 )
                {
                    STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
                    STUpUartFrame.rx_step = 3;
                }
                else
                {
                    STUpUartFrame.rx_step = 0;
                    rx_len = 0;
                }
            }
            break;
        case 3: //命令字节。（控制码）
        {
            STUpUartFrame.cmd = USART_RcvByte;
            STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
            STUpUartFrame.rx_step = 4;
        }
        break;
        case 4: //数据长度字节，接下来将要接收的数据总长度。
            if( USART_RcvByte == 0 )
            {
                STUpUartFrame.rx_step = 6;
                STUpUartFrame.len_sub = 0;
                STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
                break;
            }
            else if( USART_RcvByte >= ( MAXDOWNBUF - 32 ) )
            {
                STUpUartFrame.len_sub = ( MAXDOWNBUF - 32 );
                STUpUartFrame.is_flag = 2; //接收长度位有错。
            }
            else
            {
                STUpUartFrame.len_sub = USART_RcvByte;
                STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
            }
            STUpUartFrame.rx_step = 5;
            break;
        case 5:
            if( rx_len < STUpUartFrame.len_sub + 10 )
            {
                STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
            }
            if( rx_len >= STUpUartFrame.len_sub + 10 )
            {
                STUpUartFrame.rx_step = 6;
            }
            break;
        case 6:
            STUpUartFrame.sum = USART_RcvByte;
            STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
            STUpUartFrame.rx_step = 7;
            break;
        case 7:
            if( USART_RcvByte == 0x16 )
            {
                STUpUartFrame.is_flag = 1;
                STUpUartFrame.rx_step = 0;
                STUpUartFrame.end_char = USART_RcvByte;
                STUpUartFrame.p_buf[rx_len++] = USART_RcvByte;
                STUpUartFrame.len = rx_len;
            }
            rx_len = 0;
            break;
        default:
            rx_len = 0;
            STUpUartFrame.rx_step = 0;
            STUpUartFrame.is_flag = 0;
            break;
    }
    /*FREE RTOS times 50ms per tick*/
    STUpUartFrame.Over_time_count = 5;
    /*enable interrupt for receive next buffer*/
    if( HAL_UART_Receive_IT( &UartHandleUp, ( uint8_t* )gUpRxBuffer, 1 ) != HAL_OK )
    {
        //Error_Handler();
    }
}


